Documents/ДосрочноеЗакрытиеПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДосрочноеЗакрытиеПакета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадрыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДержательПакета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПакетыОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПакетыОпционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВестинга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВестинга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДосрочногоЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызревшиеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПакетаОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДосрочноеЗакрытиеПакета/Ext/ObjectModule.bsl
Процедура ПриПроведении()    // Получаем запись из справочника    ПакетОпционов = Справочники.ПакетыОпционов.НайтиПоСсылке(ЭтотОбъект.ПакетОпционов);    Если ПакетОпционов = Неопределено Тогда    	ВызватьИсключение "Ошибка: Пакет опционов не найден!";
	КонецЕсли;    Если ЭтотОбъект.Объект.Количество > ПакетОпционов.ВызревшиеОпционы Тогда
        Сообщить("Ошибка: Количество опционов для продажи не может превышать доступные опционы!");
        Отказ = Истина;  
        Возврат;
	КонецЕсли;         // Обновляем данные в справочнике    ПакетОпционов.ВызревшиеОпционы = ПакетОпционов.ВызревшиеОпционы - ЭтотОбъект.Количество;    ПакетОпционов.ПроданныеОпционы = ПакетОпционов.ПроданныеОпционы + ЭтотОбъект.Количество;    ПакетОпционов.ОстатокОпционовВПакете = ПакетОпционов.ВызревшиеОпционы - ПакетОпционов.ПроданныеОпционы;        // Сохраняем изменения    ПакетОпционов.Записать();КонецПроцедуры      

Процедура ОбработкаПроведения(Отказ, Режим)
	ОбъектДержателя = ЭтотОбъект.ПакетОпционов.Держатель.ПолучитьОбъект();
	АдресПолучателя = ОбъектДержателя.Почта;  
	ФИОПолучателя = ОбъектДержателя.ФИО;         
	ОбъектПакета = ЭтотОбъект.ПакетОпционов.ПолучитьОбъект();
	ТемаПисьма = "Закрытие пакета опционов❗️";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " + Символы.ПС + Символы.ПС +         
		              "Ваш пакет опционов №" + ОбъектПакета.Код + " (" + ОбъектПакета.Наименование + ") закрыт по причине '" + ЭтотОбъект.Причина + "'!✉️" + Символы.ПС + Символы.ПС +
					  "Детали: " +  Символы.ПС +	  
					  "⏰Дата начала вестинга: " + Формат(ОбъектПакета.ДатаНачалаВестинга, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +
					  "⭐Остаток опционов в пакете: " + ОбъектПакета.ОстатокОпционов + "." +  Символы.ПС + Символы.ПС +  
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки, указав номер заявки " + ЭтотОбъект.Номер + ":" +  Символы.ПС + 
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

				
МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	
КонецПроцедуры
